<script setup>
const event = ref(
    {
        id: 1,
        title: "TITSILE",
        description: "Алеша, выслушав приказание отца, которое тот выкрикнул ему из коляски, уезжая из монастыря, оставался некоторое время на месте в большом недоумении. Не то чтоб он стоял как столб, с ним этого не случалось. Напротив, он, при всем беспокойстве, успел тотчас же сходить на кухню игумена и разузнать, что наделал вверху его папаша. Затем, однако, пустился в путь, уповая, что по дороге к городу успеет как-нибудь разрешить томившую его задачу. Скажу заранее: криков отца и приказания переселиться домой, «с подушками и тюфяком», он не боялся нимало. Он слишком хорошо понял, что приказание переезжать, вслух и с таким показным криком, дано было «в увлечении», так сказать даже для красоты, — вроде как раскутившийся недавно в их же городке мещанин, на своих собственных именинах, и при гостях, рассердясь на то, что ему не дают больше водки, вдруг начал бить свою же собственную посуду, рвать свое и женино платье, разбивать свою мебель и, наконец, стекла в доме и всё опять-таки для красы; и всё в том же роде, конечно, случилось теперь и с папашей. Назавтра, конечно, раскутившийся мещанин, отрезвившись, пожалел разбитые чашки и тарелки. Алеша знал, что и старик назавтра же наверно отпустит его опять в монастырь, даже сегодня же, может, отпустит. Да и был он уверен вполне, что отец кого другого, а его обидеть не захочет. Алеша уверен был, что его и на всем свете никто и никогда обидеть не захочет, даже не только не захочет, но и не может. Это было для него аксиомой, дано раз навсегда, без рассуждений, и он в этом смысле шел вперед, безо всякого колебания.",
        startDate: "01.01.2000",
        endDate: "02.01.2000",
        author: {
            name: "Василек Василек"
        },
        members: [
            {
                name: "Василек Василек"
            },
            {
                name: "Василек Василек"
            },
            {
                name: "Василек Василек"
            },
            {
                name: "Василек Василек"
            },
            {
                name: "Василек Василек"
            },
        ]
    })
</script>

<template>
    <p class="title">{{ event.title }}</p>

</template>

<style scoped>
@import "~/assets/css/Titles.css";
</style>